tutorials/incompressible/simpleFoam/turbulentFlatPlate/system/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.3;
    format      ascii;
    class       dictionary;
    object      decomposeParDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


numberOfSubdomains	8 ;
method	hierarchical ;
simpleCoeffs
{
	n	(8 1 1);
	delta	0.001;
}
hierarchicalCoeffs
{
	n	(8 1 1);
	delta	0.001;
	order	xyz;
}
scotchCoeffs
{
	processorWeights 
	(
		 1 
		 1 
		 1 
		 1 
		 1 
		 1 
		 1 
		 1  
	);
}
manualCoeffs
{
	dataFile ("" );
}
distributed no ;
roots ();
